<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>
<body>
<header>
    <h1 align = "center"> HTML </h1>
    <a id="beg"></a>
    <nav align = "center">
        <a href="#obch">Общее представление; </a>
        <a href="#brows">Браузеры; </a> 
        <a href="#vers">Версии.</a>
    </nav>
</header>
<main>
    <article>
<p><b>HTML</b> (от англ. <i>HyperText Markup Language</i> — «язык гипертекстовой разметки»)
 — стандартизированный язык разметки веб-страниц во Всемирной паутине.
Код HTML интерпретируется браузерами; полученная в результате
интерпретации страница отображается на экране монитора компьютера
или мобильного устройства. </p>

<section>
    <a id="obch"></a>
    <h2> Общее представление</h2>
    <img src="Медиа/HTML5.png" alt="HTML5 logo" width="200" height="200" align="right">
<p>Язык гипертекстовой разметки HTML был разработан британским учёным Тимом Бернерсом-Ли приблизительно
в 1986—1991 годах в стенах ЦЕРНа в Женеве в Швейцарии. HTML создавался как язык для обмена
научной и технической документацией, пригодный для использования людьми, не являющимися специалистами
в области вёрстки. HTML успешно справлялся с проблемой сложности <abbr title="Standard Generalized Markup Language"> SGML </abbr> путём определения небольшого набора
структурных и семантических элементов — дескрипторов. Дескрипторы также часто называют «тегами». С помощью HTML
можно легко создать относительно простой, но красиво оформленный документ. Помимо упрощения структуры документа,
в HTML внесена поддержка гипертекста. Мультимедийные возможности были добавлены позже.Первым общедоступным
описанием HTML был документ «Теги HTML», впервые упомянутый в Интернете Тимом Бернерсом-Ли в конце 1991 года.
В нём описываются 18 элементов, составляющих первоначальный, относительно простой дизайн HTML.
За исключением тега гиперссылки, на них сильно повлиял SGMLguid, внутренний формат документации,
основанный на стандартном обобщенном языке разметки (SGML), в CERN. Одиннадцать из этих элементов
всё ещё существуют в HTML 4.</p>
<p>Изначально язык HTML был задуман и создан как средство структурирования и форматирования документов без их привязки к средствам воспроизведения
(отображения). В идеале, текст с разметкой HTML должен был без стилистических и структурных искажений воспроизводиться на оборудовании 
с различной технической оснащённостью (цветной экран современного компьютера, монохромный экран органайзера, ограниченный
по размерам экран мобильного телефона или устройства и программы голосового воспроизведения текстов). </p> 

  <audio src="Медиа/What is HTML_ HyperText Markup Language Explained.mp3" controls="controls"></audio>
</section>
<section>
  <a id="brows"></a>
    <h2>Браузеры</h2>
Текстовые документы, содержащие разметку на языке HTML
(такие документы традиционно имеют расширение .html или .htm),
обрабатываются специальными приложениями, которые отображают
документ в его форматированном виде. <br> Такие приложения, называемые
«браузерами» или «интернет-обозревателями» Например:
     <ol>
         <li>Google Chrome</li>
         <li>Mozilla FireFox</li>
         <li>Microsoft Edge</li>
         <li>Opera</li>
    </ol>
    И так далее...  
    <figure align = "center"> 
        <br><img src="Медиа/Browsers.jpg" alt="HTML5 logo" width="600" align="center">
        <figcaption>Браузеры</figcaption>
    </figure> 
    <a id="vers"></a>
</section>
<section>
    <h2>Версии</h2>
    <ul>
        <li>HTML 2.0 — опубликован IETF как RFC 1866 в статусе Proposed Standard (24 ноября 1995 года);</li>
        <li>HTML 3.0 — 28 марта 1995 года — IETF Internet Draft (до 28 сентября 1995 года);</li>
        <li>HTML 3.2 — 14 января 1997 года;</li>
        <li>HTML 4.0 — 18 декабря 1997 года;</li>
        <li>HTML 4.01 — 24 декабря 1999 года;</li>
        <li>ISO/IEC 15445:2000 (так называемый ISO HTML, основан на HTML 4.01 Strict) — 15 мая 2000 года;</li>
        <li>HTML5 — 28 октября 2014 года</li>
        <li>HTML 5.1 начал разрабатываться 17 декабря 2012 года. Рекомендован к применению с 1 ноября 2016 года;</li>
        <li>HTML 5.2 был представлен 14 декабря 2017 года;</li>
        <li>HTML 5.3 был представлен 24 декабря 2018 года.</li>
    </ul>  
    <figure align = "center">
    <video width = "500" controls="controls">
        <source src="Медиа/What is HTML5_.mp4">
    </video> 
    <figcaption>Видео об HTML5 2011-ого года</figcaption>
    </figure>
    <br>Официальной спецификации HTML 1.0 не существует. 
    До 1995 года существовало множество неофициальных стандартов HTML.
     Чтобы стандартная версия отличалась от них, ей сразу присвоили второй номер.
    <br>Версия 3 была предложена Консорциумом Всемирной паутины (W3C) в марте 1995 года и 
    обеспечивала много новых возможностей, таких как создание таблиц, «обтекание» изображений текстом
     и отображение сложных математических формул, поддержка gif формата. Даже при том, что этот стандарт 
     был совместим со второй версией, реализация его была сложна для браузеров того времени. Версия 3.1 официально
      никогда не предлагалась, и следующей версией стандарта HTML стала 3.2, в которой были опущены многие нововведения
       версии 3.0, но добавлены нестандартные элементы, поддерживаемые браузерами Netscape Navigator и Mosaic.
    <br> В версии HTML 4.0 произошла некоторая «очистка» стандарта. Многие элементы были отмечены как устаревшие
     и не рекомендованные (англ. deprecated). В частности, тег &lt;font&gt;, используемый для изменения свойств шрифта,
          был помечен как устаревший (вместо него рекомендуется использовать таблицы стилей CSS).
    <br>В 1998 году Консорциум Всемирной паутины начал работу над новым языком разметки, основанным на HTML 4, но соответствующим синтаксису XML.
     Впоследствии новый язык получил название XHTML. Первая версия XHTML 1.0 одобрена в качестве Рекомендации консорциума Всемирной паутины 26 января 2000 года.
    <br>Планируемая версия XHTML 2.0 должна была разорвать совместимость со старыми версиями HTML и XHTML, но 2 июля 2009 года Консорциум Всемирной паутины объявил,
     что полномочия рабочей группы XHTML2 истекают в конце 2009 года. Таким образом, была приостановлена вся дальнейшая разработка стандарта XHTML 2.0.
</section>
</article>
</main>
<footer>
    <p><a href="#beg">В начало.</a></p>
</footer>
</body>
</html>